#pragma once
//=====================================================================//
/*!	@file
	@brief	ファイラー・クラス
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "common/monograph.hpp"
#include "common/sdc_io.hpp"

namespace graphics {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	ファイラー・クラス
		@param[in]	SDC_IO	SDC I/O クラスの型
		@param[in]	BITMAP	ビットマップの型
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <class SDC_IO, class BITMAP>
	class filer {

		SDC_IO& sdc_;
		BITMAP&	bitmap_;


	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
			@param[in]	sdc	sdc_io クラス参照
			@param[in]	bitmap	ビットマップ・クラス参照
		*/
		//-----------------------------------------------------------------//
		filer(SDC_IO& sdc, BITMAP& bitmap) : sdc_(sdc), bitmap_(bitmap) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	サービス 表示、毎フレーム呼ぶ
		*/
		//-----------------------------------------------------------------//
		void service() {
		}

	};
}
