#pragma once
//=====================================================================//
/*!	@file
	@brief	１２×１２漢字フォント・クラス
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <cstdint>

namespace graphics {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	漢字フォント・クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class kfont12 {

		struct KANJI_CASH {
			uint8_t	sjis_hi;
			uint8_t	sjis_lo;
			uint8_t	bitmap[18];
		};
//		KANJI_CASH kanji_cash_[K_CASH];
//		uint8_t cash_first_;

///			for(uint8_t i = 0; i < K_CASH; ++i) {
///				kanji_cash_[i].sjis_lo = 0;
///				kanji_cash_[i].sjis_hi = 0;
///			}
///			cash_first_ = 0;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	文字の横幅
		*/
		//-----------------------------------------------------------------//
		static const uint8_t width = 12;


		//-----------------------------------------------------------------//
		/*!
			@brief	文字の高さ
		*/
		//-----------------------------------------------------------------//
		static const uint8_t height = 12;


		//-----------------------------------------------------------------//
		/*!
			@brief	文字のビットマップを取得
			@param[in]	code	文字コード
			@return 文字のビットマップ
		*/
		//-----------------------------------------------------------------//
		static const uint8_t* get(uint16_t code) {
			return nullptr;
		}
	};
}
