//=====================================================================//
/*!	@file
	@brief	R78 グループ・オプション・バイト @n
			Copyright 2016 Kunihito Hiramatsu
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdint.h>

//-----------------------------------------------------------------//
/*!
	@brief  オプション・バイト設定
*/
//-----------------------------------------------------------------//
const uint8_t opt_[] __attribute__ ((section (".opt"))) = {
	0x60,	///< ウオッチドッグ関係
	0xff,	///< LVD 設定
	0xe8,	///< オンチップオシレーター
	0x04,	///< デバッグ設定
};

// EOF
